# -*- coding: utf-8 -*-
# date: 2021/11/1
# Project: Numpy_Pandas_Notes
# File Name: 6numpy生成随机数.py
# Description: 
# Author: Anefuer_kpl
# Email: 374774222@qq.com

import numpy as np

print('================================均匀分布=======================================')
t1 = np.random.rand(3)  # 创建1维(每个维度多少个数)的均匀分布的随机数数组，浮点数，范围 0-1
print(t1)
t2 = np.random.rand(2,3) # 创建2维的均匀分布, 2行3列    PS：括号中的数 表示数组的形状
print(t2)

print('================================标准正态分布=======================================')
t3 = np.random.randn(2,3)  # 创建2维的正态分布，2行3列，  平均数为0，标准差为1
print(t3)

print('================================随机整数=======================================')
t4 = np.random.randint(low=10, high=20, size=(3,4))  # 创建 从10到20之间的随机整数，形状为3行4列的二维数组  PS: 左闭右开
print(t4)

print('================================指定范围的 均匀分布=======================================')
t5 = np.random.uniform(low=10, high=20, size=(3,4)) # 创建 从10到20之间的均匀分布的数组，形状为3行4列
print(t5)

print('================================正态分布=======================================')
t6 = np.random.normal(loc=3, scale=4, size=(3,4)) # loc表示概率分布均值，scale表示标准差。 创建均值为3，标准差为4的形状为3行4列的 正态分布
print(t6)

print('================================设定随机种子=======================================')
np.random.seed(10)  # 设定相同的随机种子，可以每次生成相同的随机数